node {
  name: "lr"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
      }
    }
  }
}
node {
  name: "pkeep"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
      }
    }
  }
}
node {
  name: "batchsize"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "shape"
    value {
      shape {
      }
    }
  }
}
node {
  name: "X"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_UINT8
    }
  }
  attr {
    key: "shape"
    value {
      shape {
      }
    }
  }
}
node {
  name: "one_hot/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "one_hot/Const_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "one_hot/depth"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 98
      }
    }
  }
}
node {
  name: "one_hot/on_value"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "one_hot/off_value"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "one_hot"
  op: "OneHot"
  input: "X"
  input: "one_hot/depth"
  input: "one_hot/on_value"
  input: "one_hot/off_value"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "TI"
    value {
      type: DT_UINT8
    }
  }
  attr {
    key: "axis"
    value {
      i: -1
    }
  }
}
node {
  name: "Y_"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_UINT8
    }
  }
  attr {
    key: "shape"
    value {
      shape {
      }
    }
  }
}
node {
  name: "one_hot_1/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "one_hot_1/Const_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "one_hot_1/depth"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 98
      }
    }
  }
}
node {
  name: "one_hot_1/on_value"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "one_hot_1/off_value"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "one_hot_1"
  op: "OneHot"
  input: "Y_"
  input: "one_hot_1/depth"
  input: "one_hot_1/on_value"
  input: "one_hot_1/off_value"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "TI"
    value {
      type: DT_UINT8
    }
  }
  attr {
    key: "axis"
    value {
      i: -1
    }
  }
}
node {
  name: "Hin"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
      }
    }
  }
}
node {
  name: "transpose/perm"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 3
          }
        }
        tensor_content: "\001\000\000\000\000\000\000\000\002\000\000\000"
      }
    }
  }
}
node {
  name: "transpose"
  op: "Transpose"
  input: "one_hot"
  input: "transpose/perm"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tperm"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "RNN/Shape"
  op: "Shape"
  input: "transpose"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "RNN/strided_slice/pack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "RNN/strided_slice/pack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 2
      }
    }
  }
}
node {
  name: "RNN/strided_slice/pack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "RNN/strided_slice"
  op: "StridedSlice"
  input: "RNN/Shape"
  input: "RNN/strided_slice/pack"
  input: "RNN/strided_slice/pack_1"
  input: "RNN/strided_slice/pack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "RNN/strided_slice_1/pack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "RNN/strided_slice_1/pack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 2
      }
    }
  }
}
node {
  name: "RNN/strided_slice_1/pack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "RNN/strided_slice_1"
  op: "StridedSlice"
  input: "RNN/Shape"
  input: "RNN/strided_slice_1/pack"
  input: "RNN/strided_slice_1/pack_1"
  input: "RNN/strided_slice_1/pack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "RNN/Shape_1"
  op: "Shape"
  input: "transpose"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "RNN/strided_slice_2/pack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "RNN/strided_slice_2/pack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "RNN/strided_slice_2/pack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "RNN/strided_slice_2"
  op: "StridedSlice"
  input: "RNN/Shape_1"
  input: "RNN/strided_slice_2/pack"
  input: "RNN/strided_slice_2/pack_1"
  input: "RNN/strided_slice_2/pack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "RNN/strided_slice_3/pack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "RNN/strided_slice_3/pack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 2
      }
    }
  }
}
node {
  name: "RNN/strided_slice_3/pack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "RNN/strided_slice_3"
  op: "StridedSlice"
  input: "RNN/Shape_1"
  input: "RNN/strided_slice_3/pack"
  input: "RNN/strided_slice_3/pack_1"
  input: "RNN/strided_slice_3/pack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "RNN/pack/1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 512
      }
    }
  }
}
node {
  name: "RNN/pack"
  op: "Pack"
  input: "RNN/strided_slice_3"
  input: "RNN/pack/1"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "axis"
    value {
      i: 0
    }
  }
}
node {
  name: "RNN/zeros/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "RNN/zeros"
  op: "Fill"
  input: "RNN/pack"
  input: "RNN/zeros/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "RNN/time"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "RNN/TensorArray"
  op: "TensorArray"
  input: "RNN/strided_slice_2"
  attr {
    key: "clear_after_read"
    value {
      b: true
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "dynamic_size"
    value {
      b: false
    }
  }
  attr {
    key: "tensor_array_name"
    value {
      s: "RNN/dynamic_rnn/output_0"
    }
  }
}
node {
  name: "RNN/TensorArray/Const"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@RNN/TensorArray"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "RNN/TensorArray_1"
  op: "TensorArray"
  input: "RNN/strided_slice_2"
  attr {
    key: "clear_after_read"
    value {
      b: true
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "dynamic_size"
    value {
      b: false
    }
  }
  attr {
    key: "tensor_array_name"
    value {
      s: "RNN/dynamic_rnn/input_0"
    }
  }
}
node {
  name: "RNN/TensorArray_1/Const"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@RNN/TensorArray_1"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "RNN/TensorArrayPack/Shape"
  op: "Shape"
  input: "transpose"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@RNN/TensorArray_1"
      }
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "RNN/TensorArrayPack/strided_slice/pack"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@RNN/TensorArray_1"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "RNN/TensorArrayPack/strided_slice/pack_1"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@RNN/TensorArray_1"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "RNN/TensorArrayPack/strided_slice/pack_2"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@RNN/TensorArray_1"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "RNN/TensorArrayPack/strided_slice"
  op: "StridedSlice"
  input: "RNN/TensorArrayPack/Shape"
  input: "RNN/TensorArrayPack/strided_slice/pack"
  input: "RNN/TensorArrayPack/strided_slice/pack_1"
  input: "RNN/TensorArrayPack/strided_slice/pack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@RNN/TensorArray_1"
      }
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "RNN/TensorArrayPack/range/start"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@RNN/TensorArray_1"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "RNN/TensorArrayPack/range/delta"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@RNN/TensorArray_1"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "RNN/TensorArrayPack/range"
  op: "Range"
  input: "RNN/TensorArrayPack/range/start"
  input: "RNN/TensorArrayPack/strided_slice"
  input: "RNN/TensorArrayPack/range/delta"
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@RNN/TensorArray_1"
      }
    }
  }
}
node {
  name: "RNN/TensorArrayPack/TensorArrayScatter"
  op: "TensorArrayScatter"
  input: "RNN/TensorArray_1"
  input: "RNN/TensorArrayPack/range"
  input: "transpose"
  input: "RNN/TensorArray_1/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@RNN/TensorArray_1"
      }
    }
  }
}
node {
  name: "RNN/TensorArrayPack/TensorArray/Const"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@RNN/TensorArray_1"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "RNN/while/Enter"
  op: "Enter"
  input: "RNN/time"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "frame_name"
    value {
      s: "RNN/while/RNN/while/"
    }
  }
  attr {
    key: "is_constant"
    value {
      b: false
    }
  }
  attr {
    key: "parallel_iterations"
    value {
      i: 32
    }
  }
}
node {
  name: "RNN/while/Enter_1"
  op: "Enter"
  input: "RNN/TensorArray/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "frame_name"
    value {
      s: "RNN/while/RNN/while/"
    }
  }
  attr {
    key: "is_constant"
    value {
      b: false
    }
  }
  attr {
    key: "parallel_iterations"
    value {
      i: 32
    }
  }
}
node {
  name: "RNN/while/Enter_2"
  op: "Enter"
  input: "Hin"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "frame_name"
    value {
      s: "RNN/while/RNN/while/"
    }
  }
  attr {
    key: "is_constant"
    value {
      b: false
    }
  }
  attr {
    key: "parallel_iterations"
    value {
      i: 32
    }
  }
}
node {
  name: "RNN/while/Merge"
  op: "Merge"
  input: "RNN/while/Enter"
  input: "RNN/while/NextIteration"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "RNN/while/Merge_1"
  op: "Merge"
  input: "RNN/while/Enter_1"
  input: "RNN/while/NextIteration_1"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "RNN/while/Merge_2"
  op: "Merge"
  input: "RNN/while/Enter_2"
  input: "RNN/while/NextIteration_2"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "RNN/while/Less/Enter"
  op: "Enter"
  input: "RNN/strided_slice_2"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "frame_name"
    value {
      s: "RNN/while/RNN/while/"
    }
  }
  attr {
    key: "is_constant"
    value {
      b: true
    }
  }
  attr {
    key: "parallel_iterations"
    value {
      i: 32
    }
  }
}
node {
  name: "RNN/while/Less"
  op: "Less"
  input: "RNN/while/Merge"
  input: "RNN/while/Less/Enter"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "RNN/while/LoopCond"
  op: "LoopCond"
  input: "RNN/while/Less"
}
node {
  name: "RNN/while/Switch"
  op: "Switch"
  input: "RNN/while/Merge"
  input: "RNN/while/LoopCond"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@RNN/while/Merge"
      }
    }
  }
}
node {
  name: "RNN/while/Switch_1"
  op: "Switch"
  input: "RNN/while/Merge_1"
  input: "RNN/while/LoopCond"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@RNN/while/Merge_1"
      }
    }
  }
}
node {
  name: "RNN/while/Switch_2"
  op: "Switch"
  input: "RNN/while/Merge_2"
  input: "RNN/while/LoopCond"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@RNN/while/Merge_2"
      }
    }
  }
}
node {
  name: "RNN/while/Identity"
  op: "Identity"
  input: "RNN/while/Switch:1"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "RNN/while/Identity_1"
  op: "Identity"
  input: "RNN/while/Switch_1:1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "RNN/while/Identity_2"
  op: "Identity"
  input: "RNN/while/Switch_2:1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "RNN/while/TensorArrayRead/RefEnter"
  op: "RefEnter"
  input: "RNN/TensorArray_1"
  attr {
    key: "T"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@RNN/TensorArray_1"
      }
    }
  }
  attr {
    key: "frame_name"
    value {
      s: "RNN/while/RNN/while/"
    }
  }
  attr {
    key: "is_constant"
    value {
      b: true
    }
  }
  attr {
    key: "parallel_iterations"
    value {
      i: 32
    }
  }
}
node {
  name: "RNN/while/TensorArrayRead/Enter"
  op: "Enter"
  input: "RNN/TensorArrayPack/TensorArrayScatter"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@RNN/TensorArray_1"
      }
    }
  }
  attr {
    key: "frame_name"
    value {
      s: "RNN/while/RNN/while/"
    }
  }
  attr {
    key: "is_constant"
    value {
      b: true
    }
  }
  attr {
    key: "parallel_iterations"
    value {
      i: 32
    }
  }
}
node {
  name: "RNN/while/TensorArrayRead"
  op: "TensorArrayRead"
  input: "RNN/while/TensorArrayRead/RefEnter"
  input: "RNN/while/Identity"
  input: "RNN/while/TensorArrayRead/Enter"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@RNN/TensorArray_1"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "RNN/while/MultiRNNCell/Cell0/Slice/begin"
  op: "Const"
  input: "^RNN/while/Identity"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "RNN/while/MultiRNNCell/Cell0/Slice/size"
  op: "Const"
  input: "^RNN/while/Identity"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\377\377\377\377\000\002\000\000"
      }
    }
  }
}
node {
  name: "RNN/while/MultiRNNCell/Cell0/Slice"
  op: "Slice"
  input: "RNN/while/Identity_2"
  input: "RNN/while/MultiRNNCell/Cell0/Slice/begin"
  input: "RNN/while/MultiRNNCell/Cell0/Slice/size"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "RNN/while/MultiRNNCell/Cell0/dropout/Shape"
  op: "Shape"
  input: "RNN/while/TensorArrayRead"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "RNN/while/MultiRNNCell/Cell0/dropout/random_uniform/min"
  op: "Const"
  input: "^RNN/while/Identity"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "RNN/while/MultiRNNCell/Cell0/dropout/random_uniform/max"
  op: "Const"
  input: "^RNN/while/Identity"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "RNN/while/MultiRNNCell/Cell0/dropout/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "RNN/while/MultiRNNCell/Cell0/dropout/Shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 81
    }
  }
}
node {
  name: "RNN/while/MultiRNNCell/Cell0/dropout/random_uniform/sub"
  op: "Sub"
  input: "RNN/while/MultiRNNCell/Cell0/dropout/random_uniform/max"
  input: "RNN/while/MultiRNNCell/Cell0/dropout/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "RNN/while/MultiRNNCell/Cell0/dropout/random_uniform/mul"
  op: "Mul"
  input: "RNN/while/MultiRNNCell/Cell0/dropout/random_uniform/RandomUniform"
  input: "RNN/while/MultiRNNCell/Cell0/dropout/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "RNN/while/MultiRNNCell/Cell0/dropout/random_uniform"
  op: "Add"
  input: "RNN/while/MultiRNNCell/Cell0/dropout/random_uniform/mul"
  input: "RNN/while/MultiRNNCell/Cell0/dropout/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "RNN/while/MultiRNNCell/Cell0/dropout/add/Enter"
  op: "Enter"
  input: "pkeep"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "frame_name"
    value {
      s: "RNN/while/RNN/while/"
    }
  }
  attr {
    key: "is_constant"
    value {
      b: true
    }
  }
  attr {
    key: "parallel_iterations"
    value {
      i: 32
    }
  }
}
node {
  name: "RNN/while/MultiRNNCell/Cell0/dropout/add"
  op: "Add"
  input: "RNN/while/MultiRNNCell/Cell0/dropout/add/Enter"
  input: "RNN/while/MultiRNNCell/Cell0/dropout/random_uniform"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "RNN/while/MultiRNNCell/Cell0/dropout/Floor"
  op: "Floor"
  input: "RNN/while/MultiRNNCell/Cell0/dropout/add"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "RNN/while/MultiRNNCell/Cell0/dropout/Div"
  op: "Div"
  input: "RNN/while/TensorArrayRead"
  input: "RNN/while/MultiRNNCell/Cell0/dropout/add/Enter"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "RNN/while/MultiRNNCell/Cell0/dropout/mul"
  op: "Mul"
  input: "RNN/while/MultiRNNCell/Cell0/dropout/Div"
  input: "RNN/while/MultiRNNCell/Cell0/dropout/Floor"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "RNN/MultiRNNCell/Cell0/GRUCell/Gates/Linear/Matrix"
  op: "Variable"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 610
        }
        dim {
          size: 1024
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "RNN/MultiRNNCell/Cell0/GRUCell/Gates/Linear/Matrix/Initializer/random_uniform/shape"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@RNN/MultiRNNCell/Cell0/GRUCell/Gates/Linear/Matrix"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "b\002\000\000\000\004\000\000"
      }
    }
  }
}
node {
  name: "RNN/MultiRNNCell/Cell0/GRUCell/Gates/Linear/Matrix/Initializer/random_uniform/min"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@RNN/MultiRNNCell/Cell0/GRUCell/Gates/Linear/Matrix"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.07012868672609329
      }
    }
  }
}
node {
  name: "RNN/MultiRNNCell/Cell0/GRUCell/Gates/Linear/Matrix/Initializer/random_uniform/max"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@RNN/MultiRNNCell/Cell0/GRUCell/Gates/Linear/Matrix"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.07012868672609329
      }
    }
  }
}
node {
  name: "RNN/MultiRNNCell/Cell0/GRUCell/Gates/Linear/Matrix/Initializer/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "RNN/MultiRNNCell/Cell0/GRUCell/Gates/Linear/Matrix/Initializer/random_uniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@RNN/MultiRNNCell/Cell0/GRUCell/Gates/Linear/Matrix"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 94
    }
  }
}
node {
  name: "RNN/MultiRNNCell/Cell0/GRUCell/Gates/Linear/Matrix/Initializer/random_uniform/sub"
  op: "Sub"
  input: "RNN/MultiRNNCell/Cell0/GRUCell/Gates/Linear/Matrix/Initializer/random_uniform/max"
  input: "RNN/MultiRNNCell/Cell0/GRUCell/Gates/Linear/Matrix/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@RNN/MultiRNNCell/Cell0/GRUCell/Gates/Linear/Matrix"
      }
    }
  }
}
node {
  name: "RNN/MultiRNNCell/Cell0/GRUCell/Gates/Linear/Matrix/Initializer/random_uniform/mul"
  op: "Mul"
  input: "RNN/MultiRNNCell/Cell0/GRUCell/Gates/Linear/Matrix/Initializer/random_uniform/RandomUniform"
  input: "RNN/MultiRNNCell/Cell0/GRUCell/Gates/Linear/Matrix/Initializer/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@RNN/MultiRNNCell/Cell0/GRUCell/Gates/Linear/Matrix"
      }
    }
  }
}
node {
  name: "RNN/MultiRNNCell/Cell0/GRUCell/Gates/Linear/Matrix/Initializer/random_uniform"
  op: "Add"
  input: "RNN/MultiRNNCell/Cell0/GRUCell/Gates/Linear/Matrix/Initializer/random_uniform/mul"
  input: "RNN/MultiRNNCell/Cell0/GRUCell/Gates/Linear/Matrix/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@RNN/MultiRNNCell/Cell0/GRUCell/Gates/Linear/Matrix"
      }
    }
  }
}
node {
  name: "RNN/MultiRNNCell/Cell0/GRUCell/Gates/Linear/Matrix/Assign"
  op: "Assign"
  input: "RNN/MultiRNNCell/Cell0/GRUCell/Gates/Linear/Matrix"
  input: "RNN/MultiRNNCell/Cell0/GRUCell/Gates/Linear/Matrix/Initializer/random_uniform"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@RNN/MultiRNNCell/Cell0/GRUCell/Gates/Linear/Matrix"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "RNN/MultiRNNCell/Cell0/GRUCell/Gates/Linear/Matrix/read"
  op: "Identity"
  input: "RNN/MultiRNNCell/Cell0/GRUCell/Gates/Linear/Matrix"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "RNN/while/MultiRNNCell/Cell0/GRUCell/Gates/Linear/concat/concat_dim"
  op: "Const"
  input: "^RNN/while/Identity"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "RNN/while/MultiRNNCell/Cell0/GRUCell/Gates/Linear/concat"
  op: "Concat"
  input: "RNN/while/MultiRNNCell/Cell0/GRUCell/Gates/Linear/concat/concat_dim"
  input: "RNN/while/MultiRNNCell/Cell0/dropout/mul"
  input: "RNN/while/MultiRNNCell/Cell0/Slice"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "RNN/while/MultiRNNCell/Cell0/GRUCell/Gates/Linear/MatMul/Enter"
  op: "Enter"
  input: "RNN/MultiRNNCell/Cell0/GRUCell/Gates/Linear/Matrix/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "frame_name"
    value {
      s: "RNN/while/RNN/while/"
    }
  }
  attr {
    key: "is_constant"
    value {
      b: true
    }
  }
  attr {
    key: "parallel_iterations"
    value {
      i: 32
    }
  }
}
node {
  name: "RNN/while/MultiRNNCell/Cell0/GRUCell/Gates/Linear/MatMul"
  op: "MatMul"
  input: "RNN/while/MultiRNNCell/Cell0/GRUCell/Gates/Linear/concat"
  input: "RNN/while/MultiRNNCell/Cell0/GRUCell/Gates/Linear/MatMul/Enter"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "RNN/MultiRNNCell/Cell0/GRUCell/Gates/Linear/Bias"
  op: "Variable"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 1024
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "RNN/MultiRNNCell/Cell0/GRUCell/Gates/Linear/Bias/Initializer/Const"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@RNN/MultiRNNCell/Cell0/GRUCell/Gates/Linear/Bias"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 1024
          }
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "RNN/MultiRNNCell/Cell0/GRUCell/Gates/Linear/Bias/Assign"
  op: "Assign"
  input: "RNN/MultiRNNCell/Cell0/GRUCell/Gates/Linear/Bias"
  input: "RNN/MultiRNNCell/Cell0/GRUCell/Gates/Linear/Bias/Initializer/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@RNN/MultiRNNCell/Cell0/GRUCell/Gates/Linear/Bias"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "RNN/MultiRNNCell/Cell0/GRUCell/Gates/Linear/Bias/read"
  op: "Identity"
  input: "RNN/MultiRNNCell/Cell0/GRUCell/Gates/Linear/Bias"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "RNN/while/MultiRNNCell/Cell0/GRUCell/Gates/add/Enter"
  op: "Enter"
  input: "RNN/MultiRNNCell/Cell0/GRUCell/Gates/Linear/Bias/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "frame_name"
    value {
      s: "RNN/while/RNN/while/"
    }
  }
  attr {
    key: "is_constant"
    value {
      b: true
    }
  }
  attr {
    key: "parallel_iterations"
    value {
      i: 32
    }
  }
}
node {
  name: "RNN/while/MultiRNNCell/Cell0/GRUCell/Gates/add"
  op: "Add"
  input: "RNN/while/MultiRNNCell/Cell0/GRUCell/Gates/Linear/MatMul"
  input: "RNN/while/MultiRNNCell/Cell0/GRUCell/Gates/add/Enter"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "RNN/while/MultiRNNCell/Cell0/GRUCell/Gates/split/split_dim"
  op: "Const"
  input: "^RNN/while/Identity"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "RNN/while/MultiRNNCell/Cell0/GRUCell/Gates/split"
  op: "Split"
  input: "RNN/while/MultiRNNCell/Cell0/GRUCell/Gates/split/split_dim"
  input: "RNN/while/MultiRNNCell/Cell0/GRUCell/Gates/add"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "num_split"
    value {
      i: 2
    }
  }
}
node {
  name: "RNN/while/MultiRNNCell/Cell0/GRUCell/Gates/Sigmoid"
  op: "Sigmoid"
  input: "RNN/while/MultiRNNCell/Cell0/GRUCell/Gates/split"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "RNN/while/MultiRNNCell/Cell0/GRUCell/Gates/Sigmoid_1"
  op: "Sigmoid"
  input: "RNN/while/MultiRNNCell/Cell0/GRUCell/Gates/split:1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "RNN/while/MultiRNNCell/Cell0/GRUCell/Candidate/mul"
  op: "Mul"
  input: "RNN/while/MultiRNNCell/Cell0/GRUCell/Gates/Sigmoid"
  input: "RNN/while/MultiRNNCell/Cell0/Slice"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "RNN/MultiRNNCell/Cell0/GRUCell/Candidate/Linear/Matrix"
  op: "Variable"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 610
        }
        dim {
          size: 512
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "RNN/MultiRNNCell/Cell0/GRUCell/Candidate/Linear/Matrix/Initializer/random_uniform/shape"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@RNN/MultiRNNCell/Cell0/GRUCell/Candidate/Linear/Matrix"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "b\002\000\000\000\002\000\000"
      }
    }
  }
}
node {
  name: "RNN/MultiRNNCell/Cell0/GRUCell/Candidate/Linear/Matrix/Initializer/random_uniform/min"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@RNN/MultiRNNCell/Cell0/GRUCell/Candidate/Linear/Matrix"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.07012868672609329
      }
    }
  }
}
node {
  name: "RNN/MultiRNNCell/Cell0/GRUCell/Candidate/Linear/Matrix/Initializer/random_uniform/max"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@RNN/MultiRNNCell/Cell0/GRUCell/Candidate/Linear/Matrix"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.07012868672609329
      }
    }
  }
}
node {
  name: "RNN/MultiRNNCell/Cell0/GRUCell/Candidate/Linear/Matrix/Initializer/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "RNN/MultiRNNCell/Cell0/GRUCell/Candidate/Linear/Matrix/Initializer/random_uniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@RNN/MultiRNNCell/Cell0/GRUCell/Candidate/Linear/Matrix"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 119
    }
  }
}
node {
  name: "RNN/MultiRNNCell/Cell0/GRUCell/Candidate/Linear/Matrix/Initializer/random_uniform/sub"
  op: "Sub"
  input: "RNN/MultiRNNCell/Cell0/GRUCell/Candidate/Linear/Matrix/Initializer/random_uniform/max"
  input: "RNN/MultiRNNCell/Cell0/GRUCell/Candidate/Linear/Matrix/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@RNN/MultiRNNCell/Cell0/GRUCell/Candidate/Linear/Matrix"
      }
    }
  }
}
node {
  name: "RNN/MultiRNNCell/Cell0/GRUCell/Candidate/Linear/Matrix/Initializer/random_uniform/mul"
  op: "Mul"
  input: "RNN/MultiRNNCell/Cell0/GRUCell/Candidate/Linear/Matrix/Initializer/random_uniform/RandomUniform"
  input: "RNN/MultiRNNCell/Cell0/GRUCell/Candidate/Linear/Matrix/Initializer/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@RNN/MultiRNNCell/Cell0/GRUCell/Candidate/Linear/Matrix"
      }
    }
  }
}
node {
  name: "RNN/MultiRNNCell/Cell0/GRUCell/Candidate/Linear/Matrix/Initializer/random_uniform"
  op: "Add"
  input: "RNN/MultiRNNCell/Cell0/GRUCell/Candidate/Linear/Matrix/Initializer/random_uniform/mul"
  input: "RNN/MultiRNNCell/Cell0/GRUCell/Candidate/Linear/Matrix/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@RNN/MultiRNNCell/Cell0/GRUCell/Candidate/Linear/Matrix"
      }
    }
  }
}
node {
  name: "RNN/MultiRNNCell/Cell0/GRUCell/Candidate/Linear/Matrix/Assign"
  op: "Assign"
  input: "RNN/MultiRNNCell/Cell0/GRUCell/Candidate/Linear/Matrix"
  input: "RNN/MultiRNNCell/Cell0/GRUCell/Candidate/Linear/Matrix/Initializer/random_uniform"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@RNN/MultiRNNCell/Cell0/GRUCell/Candidate/Linear/Matrix"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "RNN/MultiRNNCell/Cell0/GRUCell/Candidate/Linear/Matrix/read"
  op: "Identity"
  input: "RNN/MultiRNNCell/Cell0/GRUCell/Candidate/Linear/Matrix"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "RNN/while/MultiRNNCell/Cell0/GRUCell/Candidate/Linear/concat/concat_dim"
  op: "Const"
  input: "^RNN/while/Identity"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "RNN/while/MultiRNNCell/Cell0/GRUCell/Candidate/Linear/concat"
  op: "Concat"
  input: "RNN/while/MultiRNNCell/Cell0/GRUCell/Candidate/Linear/concat/concat_dim"
  input: "RNN/while/MultiRNNCell/Cell0/dropout/mul"
  input: "RNN/while/MultiRNNCell/Cell0/GRUCell/Candidate/mul"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "RNN/while/MultiRNNCell/Cell0/GRUCell/Candidate/Linear/MatMul/Enter"
  op: "Enter"
  input: "RNN/MultiRNNCell/Cell0/GRUCell/Candidate/Linear/Matrix/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "frame_name"
    value {
      s: "RNN/while/RNN/while/"
    }
  }
  attr {
    key: "is_constant"
    value {
      b: true
    }
  }
  attr {
    key: "parallel_iterations"
    value {
      i: 32
    }
  }
}
node {
  name: "RNN/while/MultiRNNCell/Cell0/GRUCell/Candidate/Linear/MatMul"
  op: "MatMul"
  input: "RNN/while/MultiRNNCell/Cell0/GRUCell/Candidate/Linear/concat"
  input: "RNN/while/MultiRNNCell/Cell0/GRUCell/Candidate/Linear/MatMul/Enter"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "RNN/MultiRNNCell/Cell0/GRUCell/Candidate/Linear/Bias"
  op: "Variable"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 512
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "RNN/MultiRNNCell/Cell0/GRUCell/Candidate/Linear/Bias/Initializer/Const"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@RNN/MultiRNNCell/Cell0/GRUCell/Candidate/Linear/Bias"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 512
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "RNN/MultiRNNCell/Cell0/GRUCell/Candidate/Linear/Bias/Assign"
  op: "Assign"
  input: "RNN/MultiRNNCell/Cell0/GRUCell/Candidate/Linear/Bias"
  input: "RNN/MultiRNNCell/Cell0/GRUCell/Candidate/Linear/Bias/Initializer/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@RNN/MultiRNNCell/Cell0/GRUCell/Candidate/Linear/Bias"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "RNN/MultiRNNCell/Cell0/GRUCell/Candidate/Linear/Bias/read"
  op: "Identity"
  input: "RNN/MultiRNNCell/Cell0/GRUCell/Candidate/Linear/Bias"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "RNN/while/MultiRNNCell/Cell0/GRUCell/Candidate/add/Enter"
  op: "Enter"
  input: "RNN/MultiRNNCell/Cell0/GRUCell/Candidate/Linear/Bias/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "frame_name"
    value {
      s: "RNN/while/RNN/while/"
    }
  }
  attr {
    key: "is_constant"
    value {
      b: true
    }
  }
  attr {
    key: "parallel_iterations"
    value {
      i: 32
    }
  }
}
node {
  name: "RNN/while/MultiRNNCell/Cell0/GRUCell/Candidate/add"
  op: "Add"
  input: "RNN/while/MultiRNNCell/Cell0/GRUCell/Candidate/Linear/MatMul"
  input: "RNN/while/MultiRNNCell/Cell0/GRUCell/Candidate/add/Enter"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "RNN/while/MultiRNNCell/Cell0/GRUCell/Candidate/Tanh"
  op: "Tanh"
  input: "RNN/while/MultiRNNCell/Cell0/GRUCell/Candidate/add"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "RNN/while/MultiRNNCell/Cell0/GRUCell/mul"
  op: "Mul"
  input: "RNN/while/MultiRNNCell/Cell0/GRUCell/Gates/Sigmoid_1"
  input: "RNN/while/MultiRNNCell/Cell0/Slice"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "RNN/while/MultiRNNCell/Cell0/GRUCell/sub/x"
  op: "Const"
  input: "^RNN/while/Identity"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "RNN/while/MultiRNNCell/Cell0/GRUCell/sub"
  op: "Sub"
  input: "RNN/while/MultiRNNCell/Cell0/GRUCell/sub/x"
  input: "RNN/while/MultiRNNCell/Cell0/GRUCell/Gates/Sigmoid_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "RNN/while/MultiRNNCell/Cell0/GRUCell/mul_1"
  op: "Mul"
  input: "RNN/while/MultiRNNCell/Cell0/GRUCell/sub"
  input: "RNN/while/MultiRNNCell/Cell0/GRUCell/Candidate/Tanh"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "RNN/while/MultiRNNCell/Cell0/GRUCell/add"
  op: "Add"
  input: "RNN/while/MultiRNNCell/Cell0/GRUCell/mul"
  input: "RNN/while/MultiRNNCell/Cell0/GRUCell/mul_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "RNN/while/MultiRNNCell/Cell1/Slice/begin"
  op: "Const"
